LogMaster/wrk2/HtmlVaporClientWrkV1bc.txt
Running 5m test @ http://169.254.185.136:8080/htmlVapor
  2 threads and 5 connections
  Thread calibration: mean lat.: 5.253ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 5.332ms, rate sampling interval: 20ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.59ms    1.85ms  12.30ms   74.44%
    Req/Sec    52.62     42.73   111.00     47.05%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.10ms
 75.000%    4.39ms
 90.000%    6.32ms
 99.000%    9.35ms
 99.900%   11.60ms
 99.990%   12.26ms
 99.999%   12.31ms
100.000%   12.31ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.395     0.000000            1         1.00
       1.736     0.100000         2900         1.11
       2.133     0.200000         5808         1.25
       2.453     0.300000         8701         1.43
       2.747     0.400000        11603         1.67
       3.097     0.500000        14520         2.00
       3.301     0.550000        15954         2.22
       3.533     0.600000        17410         2.50
       3.773     0.650000        18850         2.86
       4.059     0.700000        20298         3.33
       4.395     0.750000        21758         4.00
       4.619     0.775000        22487         4.44
       4.855     0.800000        23207         5.00
       5.143     0.825000        23924         5.71
       5.507     0.850000        24647         6.67
       5.899     0.875000        25381         8.00
       6.111     0.887500        25734         8.89
       6.319     0.900000        26103        10.00
       6.539     0.912500        26463        11.43
       6.755     0.925000        26823        13.33
       7.047     0.937500        27184        16.00
       7.259     0.943750        27366        17.78
       7.491     0.950000        27547        20.00
       7.723     0.956250        27729        22.86
       7.923     0.962500        27909        26.67
       8.131     0.968750        28090        32.00
       8.247     0.971875        28181        35.56
       8.383     0.975000        28273        40.00
       8.535     0.978125        28364        45.71
       8.719     0.981250        28459        53.33
       8.911     0.984375        28551        64.00
       9.015     0.985938        28593        71.11
       9.119     0.987500        28635        80.00
       9.255     0.989062        28679        91.43
       9.447     0.990625        28725       106.67
       9.647     0.992188        28770       128.00
       9.783     0.992969        28793       142.22
       9.879     0.993750        28816       160.00
       9.991     0.994531        28840       182.86
      10.143     0.995313        28861       213.33
      10.319     0.996094        28883       256.00
      10.415     0.996484        28895       284.44
      10.631     0.996875        28906       320.00
      10.711     0.997266        28917       365.71
      10.799     0.997656        28930       426.67
      10.991     0.998047        28940       512.00
      11.071     0.998242        28947       568.89
      11.135     0.998437        28951       640.00
      11.279     0.998633        28957       731.43
      11.399     0.998828        28963       853.33
      11.615     0.999023        28968      1024.00
      11.679     0.999121        28971      1137.78
      11.719     0.999219        28974      1280.00
      11.847     0.999316        28977      1462.86
      11.927     0.999414        28980      1706.67
      11.967     0.999512        28982      2048.00
      11.991     0.999561        28984      2275.56
      12.039     0.999609        28985      2560.00
      12.079     0.999658        28987      2925.71
      12.119     0.999707        28988      3413.33
      12.143     0.999756        28989      4096.00
      12.207     0.999780        28991      4551.11
      12.207     0.999805        28991      5120.00
      12.239     0.999829        28992      5851.43
      12.239     0.999854        28992      6826.67
      12.255     0.999878        28993      8192.00
      12.255     0.999890        28993      9102.22
      12.287     0.999902        28994     10240.00
      12.287     0.999915        28994     11702.86
      12.287     0.999927        28994     13653.33
      12.295     0.999939        28995     16384.00
      12.295     0.999945        28995     18204.44
      12.295     0.999951        28995     20480.00
      12.295     0.999957        28995     23405.71
      12.295     0.999963        28995     27306.67
      12.311     0.999969        28996     32768.00
      12.311     1.000000        28996          inf
#[Mean    =        3.594, StdDeviation   =        1.846]
#[Max     =       12.304, Total count    =        28996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30002 requests in 5.00m, 44.89MB read
Requests/sec:    100.00
Transfer/sec:    153.23KB

 >> |2017/09/06 21:55:36|HtmlVaporClientWrkV1bc|Vapor HTML benchmarking
wrk2 -t2 -d5m -c5 --latency -R100 --timeout 100s http://169.254.185.136:8080/htmlVapor