LogMaster/wrk2/JsonPerfectClientWrk2V1.txt
Running 5m test @ http://169.254.185.136:8081/jsonPerfect
  2 threads and 5 connections
  Thread calibration: mean lat.: 6.319ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.385ms, rate sampling interval: 18ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.84ms    1.40ms  13.71ms   72.35%
    Req/Sec   153.95     35.18   235.00     55.75%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.48ms
 75.000%    6.54ms
 90.000%    7.88ms
 99.000%    9.90ms
 99.900%   11.48ms
 99.990%   12.66ms
 99.999%   13.55ms
100.000%   13.72ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.211     0.000000            1         1.00
       4.363     0.100000         8728         1.11
       4.747     0.200000        17413         1.25
       5.019     0.300000        26161         1.43
       5.235     0.400000        34815         1.67
       5.479     0.500000        43525         2.00
       5.635     0.550000        47851         2.22
       5.807     0.600000        52206         2.50
       5.999     0.650000        56609         2.86
       6.231     0.700000        60899         3.33
       6.539     0.750000        65278         4.00
       6.719     0.775000        67447         4.44
       6.907     0.800000        69617         5.00
       7.103     0.825000        71779         5.71
       7.319     0.850000        73960         6.67
       7.587     0.875000        76147         8.00
       7.727     0.887500        77219         8.89
       7.879     0.900000        78314        10.00
       8.043     0.912500        79405        11.43
       8.231     0.925000        80516        13.33
       8.423     0.937500        81588        16.00
       8.543     0.943750        82119        17.78
       8.687     0.950000        82666        20.00
       8.839     0.956250        83192        22.86
       9.031     0.962500        83744        26.67
       9.223     0.968750        84295        32.00
       9.303     0.971875        84554        35.56
       9.399     0.975000        84833        40.00
       9.495     0.978125        85111        45.71
       9.575     0.981250        85377        53.33
       9.671     0.984375        85654        64.00
       9.719     0.985938        85774        71.11
       9.783     0.987500        85910        80.00
       9.855     0.989062        86051        91.43
       9.943     0.990625        86198       106.67
      10.047     0.992188        86317       128.00
      10.103     0.992969        86385       142.22
      10.199     0.993750        86457       160.00
      10.311     0.994531        86525       182.86
      10.439     0.995313        86594       213.33
      10.631     0.996094        86658       256.00
      10.735     0.996484        86691       284.44
      10.839     0.996875        86727       320.00
      10.951     0.997266        86762       365.71
      11.055     0.997656        86796       426.67
      11.151     0.998047        86827       512.00
      11.231     0.998242        86846       568.89
      11.287     0.998437        86861       640.00
      11.359     0.998633        86880       731.43
      11.415     0.998828        86895       853.33
      11.495     0.999023        86913      1024.00
      11.543     0.999121        86920      1137.78
      11.591     0.999219        86930      1280.00
      11.679     0.999316        86937      1462.86
      11.775     0.999414        86946      1706.67
      11.911     0.999512        86956      2048.00
      11.935     0.999561        86958      2275.56
      12.015     0.999609        86963      2560.00
      12.071     0.999658        86967      2925.71
      12.183     0.999707        86971      3413.33
      12.247     0.999756        86975      4096.00
      12.311     0.999780        86977      4551.11
      12.439     0.999805        86980      5120.00
      12.495     0.999829        86982      5851.43
      12.639     0.999854        86984      6826.67
      12.655     0.999878        86986      8192.00
      12.663     0.999890        86987      9102.22
      12.759     0.999902        86988     10240.00
      12.815     0.999915        86989     11702.86
      12.831     0.999927        86990     13653.33
      12.887     0.999939        86991     16384.00
      12.951     0.999945        86992     18204.44
      12.951     0.999951        86992     20480.00
      13.079     0.999957        86993     23405.71
      13.079     0.999963        86993     27306.67
      13.551     0.999969        86995     32768.00
      13.551     0.999973        86995     36408.89
      13.551     0.999976        86995     40960.00
      13.551     0.999979        86995     46811.43
      13.551     0.999982        86995     54613.33
      13.551     0.999985        86995     65536.00
      13.551     0.999986        86995     72817.78
      13.551     0.999988        86995     81920.00
      13.719     0.999989        86996     93622.86
      13.719     1.000000        86996          inf
#[Mean    =        5.840, StdDeviation   =        1.396]
#[Max     =       13.712, Total count    =        86996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  90002 requests in 5.00m, 601.26MB read
Requests/sec:    300.00
Transfer/sec:      2.00MB

 >> |2017/09/07 09:41:08|JsonPerfectClientWrk2V1|Perfect JSON benchmarking / Business case
wrk2 -t2 -d5m -c5 --latency -R300 --timeout 100s http://169.254.185.136:8081/jsonPerfect